[{"text":"that","pronunciation":{"spell":"th at; unstressed th uh t","ipa":"ðæt; unstressed ðət"},"usages":[{"type":"pronoun","meanings":[{"example":"That is her mother. After that we saw each other.","definition":" (used to indicate a person, thing, idea, state, event, time, remark, etc., as pointed out or present, mentioned before, supposed to be understood, or by way of emphasis): "},{"example":"This is my sister and that's my cousin.","definition":" (used to indicate one of two or more persons, things, etc., already mentioned, referring to the one more remote in place, time, or thought; opposed to this): "},{"example":"This suit fits better than that.","definition":" (used to indicate one of two or more persons, things, etc., already mentioned, implying a contrast or contradistinction; opposed to this): "},{"example":"the horse that he bought.","definition":" (used as the subject or object of a relative clause, especially one defining or restricting the antecedent, sometimes replaceable by who, whom, or which): "},{"example":"the farm that I spoke of.","definition":" (used as the object of a preposition, with the preposition standing at the end of a relative clause): "},{"example":"fool that he is.","definition":" (used in various special or elliptical constructions): "}]},{"type":"adjective","meanings":[{"example":"That woman is her mother. Those little mannerisms of hers make me sick.","definition":" (used to indicate a person, place, thing, or degree as indicated, mentioned before, present, or as well-known or characteristic): "},{"example":"This room is his and that one is mine.","definition":" (used to indicate the more remote in time, place, or thought of two persons, things, etc., already mentioned; opposed to this): "},{"example":"not this house, but that one.","definition":" (used to imply mere contradistinction; opposed to this): "}]},{"type":"adverb","meanings":[{"example":"that much; The fish was that big.","definition":" (used with adjectives and adverbs of quantity or extent) to the extent or degree indicated: "},{"example":"It's not that important.","definition":" to a great extent or degree; very: "},{"example":"He was that weak he could hardly stand.","definition":" Dialect. (used to modify an adjective or another adverb) to such an extent: "}]},{"type":"conjunction","meanings":[{"example":"I'm sure that you'll like it. That he will come is certain. Hold it up so that everyone can see it.","definition":" (used to introduce a subordinate clause as the subject or object of the principal verb or as the necessary complement to a statement made, or a clause expressing cause or reason, purpose or aim, result or consequence, etc.): "},{"example":"Oh, that I had never been born!","definition":" (used elliptically to introduce an exclamation expressing desire, a wish, surprise, indignation, or other strong feeling): "}]},{"type":"Idioms","meanings":[{"example":"Although perhaps too elaborate, it seemed like a good plan at that.","definition":" at that, in spite of something; nevertheless: "},{"example":"I read the book, that is, I read most of it.","definition":" that is, (by way of explanation, clarification, or an example); more accurately: "},{"example":"I'm not going, and that's that!","definition":" that's that, Informal. there is no more to be said or done; that is finished: "},{"example":"The star and the director are that way. I'm that way about coffee.","definition":" that way, Informal. in love or very fond of (usually followed by about or for): "},{"example":"With that, he turned on his heel and fled.","definition":" with that, following that; thereupon: "}]}]},{"text":"that's","pronunciation":{"spell":"th ats; unstressed th uh ts","ipa":"ðæts; unstressed ðəts"},"usages":[]}]